Revit 2017 API
ProjectLocation.Name Property
The name of the project location.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Syntax
C#
public override string Name { get; set; }
Visual Basic
Public Overrides Property Name As String
	Get
	Set
Visual C++
public:
virtual property String^ Name {
	String^ get () override;
	void set (String^ value) override;
}
Remarks
This property is used to get or set the name of the project location.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException | Thrown when failing to set the name (for example, because it is not unique).
See Also
ProjectLocation Class
Autodesk.Revit.DB Namespace